CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
/**
 * @file main.cpp
 * @brief Implementation of an ESP32-based sensor data logger and transmitter.
 *
 * This program is designed to collect data from sensors (e.g., PMS5003, DHT22), log the data in memory and on an SD card,
 * and transmit the data to a remote server using GSM/GPRS. The program supports JSON and CSV data formats for logging
 * and transmission. It also handles network time synchronization and manages failed data transmissions by retrying
 * them later.
 *
 * @details
 * - The program initializes the PMS5003 sensor, DHT22 sensor (if available), and GSM module (if available).
 * - Data is collected at regular intervals and logged in memory or on an SD card.
 * - Data is transmitted to a server at specified intervals.
 * - Failed transmissions are stored and retried later.
 * - The program uses the ArduinoJson library for JSON handling and the TimeLib library for time management.
 * - SD card operations are performed using a custom file handling API.
 *
 * @note The program assumes the presence of specific hardware components, including an SD card module, PMS5003 sensor,
 * and GSM module. It also assumes that the GSM module supports GPRS and can fetch network time.
 *
 * @author Gideon Maina
 *
 * @dependencies
 * - ArduinoJson
 * - TimeLib
 * - PMserial
 * - SD_handler
 * - gsm::QuectelModem and gsm::GsmMqttClient
 * - dhtnew : https://github.com/RobTillaart/DHTNew
 *
 * @hardware
 * - ESP32 microcontroller
 * - PMS5003 sensor
 * - GSM module
 * - SD card module
 * - DHT22 sensor (optional)
 *
 * @todo
 * - Implement support for other network connections (e.g., WiFi, LoRa).
 * - Improve JSON validation logic.
 * - Add error handling for SD card operations.
 * - Optimize memory usage for large data sets.
 * - Improve time handling.
 * - Improve power management for battery-operated devices.
 */

#include "global_configs.h"
#include "helpers.h"
#include "PMserial.h"
#include "utils/SD_handler.h"
#include "utils/gsm/AtClient.h"
#include "utils/gsm/QuectelModem.h"
#include "utils/gsm/GsmMqttClient.h"
#include <TimeLib.h>
#include <ESP32Time.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include "dhtnew.h"
#include "utils/wifi.h"
#include "utils/deviceconfig.h"
#include "webserver/asyncserver.h"
#include "utils/mqtt_wifi.h"
#include "utils/homeassistant.h"
#include "utils/mozilla_ca_bundle.h"

namespace
{
    gsm::SerialConfig makeGsmSerialConfig()
    {
        gsm::SerialConfig config;
#ifdef QUECTEL_PWR_KEY
        config.powerKeyPin = QUECTEL_PWR_KEY;
#endif
#ifdef GSM_RST_PIN
        config.resetPin = GSM_RST_PIN;
        // Board-tested MCU waveform; the modem-side RESET_N polarity differs.
        config.resetSequence = gsm::ResetSequence::LowHighLow;
#endif
#ifdef MCU_RXD
        config.rxPin = MCU_RXD;
#endif
#ifdef MCU_TXD
        config.txPin = MCU_TXD;
#endif
#ifdef GSM_DEBUG
        config.debugEnabled = GSM_DEBUG;
#endif
        return config;
    }

    // One modem channel, owned by this translation unit and used from setup()/loop().
    // Construction order keeps each dependency alive for all of its consumers.
    HardwareSerial modemSerial(2);
    gsm::AtClient modemAt(modemSerial, Serial);
    gsm::QuectelModem modem(modemAt, Serial, makeGsmSerialConfig());
    gsm::GsmMqttClient gsmMqtt(modemAt, Serial, modem.failures());
    gsm::RuntimeInfo gsmRuntimeInfo;
    bool gsmMqttSubscriptionReady = false; // Configuration topic on MQTT_CLIENT_ID.
} // namespace

size_t max_wifi_hotspots_size = sizeof(struct_wifiInfo) * 20;
struct struct_wifiInfo *wifiInfo = (struct_wifiInfo *)malloc(max_wifi_hotspots_size);
uint8_t count_wifiInfo;

DHTNEW dht(ONEWIRE_PIN);                           // DHT sensor, pin, type
SerialPM pms(PMS5003, PM_SERIAL_RX, PM_SERIAL_TX); // PMSx003, RX, TX

const unsigned long ONE_DAY_IN_MS = 24 * 60 * 60 * 1000;
const unsigned long DURATION_BEFORE_FORCED_RESTART_MS = ONE_DAY_IN_MS * 28; // force a reboot every month /
const unsigned long SEND_TELEMETRY_INTERVAL_MS = 30 * 60 * 1000;            // 30 minutes

unsigned long act_milli;
unsigned long last_read_sensors_data = 0;
int sampling_interval = 5 * 60 * 1000; // 5 minutes
unsigned long starttime, boottime = 0;
unsigned sending_intervall_ms = 30 * 60 * 1000; // 30 minutes
unsigned long count_sends = 0;
unsigned long last_send_telemetry = 0;
bool boot_telemetry_sent = false;                        // Tracks if telemetry has been sent on boot
const unsigned long BOOT_TELEMETRY_DELAY_MS = 30 * 1000; // 30 seconds - time to allow connections to establish

char csv_header[255] = "timestamp,value_type,value,unit,sensor_type";

bool SD_Attached = false;

char ROOT_DIR[24] = {};
char BASE_SENSORS_DATA_DIR[20] = "/SENSORSDATA";
const char TESTING_SENSORS_DATA_DIR[] = "/TESTING";
char CURRENT_SENSORS_DATA_DIR[128] = {};
char SENSORS_JSON_DATA_PATH[128] = {};
char SENSORS_CSV_DATA_PATH[128] = {};
char SENSORS_FAILED_DATA_SEND_STORE_FILE[40] = "failed_send_payloads.txt";
char SENSORS_FAILED_DATA_SEND_STORE_PATH[128] = {};
char MQTT_TELEMETRY_TOPIC[128] = {};

char esp_chipid[18] = {};
bool send_now = false;
char incoming_topic_store[64];
char incoming_message_store[256];

ESP32Time RTC;
char time_buff[32] = {};
const char *ISO_time_format = "%Y-%m-%dT%H:%M:%S"; // ISO 8601 format
struct datetimetz
{
    tmElements_t datetime;
    time_t timestamp;
    char timezone[6] = {}; // e.g. +0300 // +03
} esp_datetime_tz;

enum SensorAPI_PIN
{
    PMS = PMS_API_PIN,
    DHT = DHT_API_PIN
};

enum DATA_LOGGERS
{
    JSON,
    CSV
};

struct LOGGER
{
    const char *name;
    char *path;
    DATA_LOGGERS type;
    static const int MAX_ENTRIES = 48;
    static const int ENTRY_SIZE = 255;
    char DATA_STORE[MAX_ENTRIES][ENTRY_SIZE] = {};
    int log_count = 0;
} JSON_PAYLOAD_LOGGER, CSV_PAYLOAD_LOGGER;

JsonDocument gsm_info;
JsonDocument device_info;
struct DeviceConfigState DeviceConfigState;
struct DeviceConfig DeviceConfig;

// WiFi credentials
char AP_SSID[64];
const char *AP_PWD = "admin@sensors.cfa";
JsonDocument wifi_info;

/**
 * @brief Communication Manager State
 * Tracks communication status, connectivity, and failover logic
 */
struct CommsManagerState
{
    enum PreferredComm
    {
        NONE = 0,
        WIFI = 1,
        GSM = 2
    } preferredComm;

    uint8_t wifiFailCount;
    uint8_t gsmFailCount;
    uint8_t MAX_RETRY_ATTEMPTS = 10;
    unsigned long lastWiFiAttempt;
    unsigned long lastGSMAttempt;
    unsigned long lastConnectivityCheck; // Last ping check time
    unsigned long reconnectInterval;     // Dynamic interval based on failures
    bool allCommsUnavailable;
    bool wifiOnline;
    bool gsmOnline;
    bool maxReconnectAttemptsReached;
    bool mqttConnectionInitialized;
    unsigned long lastMQTTCheck;
    bool message_received;

