CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // Initialize state
    void init()
    {
        preferredComm = NONE;
        wifiFailCount = 0;
        gsmFailCount = 0;
        lastWiFiAttempt = 0;
        lastGSMAttempt = 0;
        lastConnectivityCheck = 0;
        reconnectInterval = 60000 * 5; // Start with 5min interval
        allCommsUnavailable = true;
        wifiOnline = false;
        gsmOnline = false;
        maxReconnectAttemptsReached = false;
        mqttConnectionInitialized = false;
    }
} CommsManagerState;

void readDHT();
void getPMSREADINGS();
void printPM_values();
void printPM_Error();
void generateJSON_payload(char *res, JsonDocument &data, const char *timestamp, SensorAPI_PIN pin, size_t size);
bool sendData(const char *data, const int _pin, const char *url);
datetimetz extractDateTime(String datetimeStr);
String formatDateTime(time_t t, String timezone);
String getRTCdatetimetz(const char *format, char *timezone);
void init_memory_loggers();
void init_SD_loggers();
void getMonthName(int month_num, char *month);
void readSendDelete(const char *datafile);
void initCalender(int year, int month);
void updateCalendarFromRTC();
void memoryDataLog(LOGGER &logger, const char *data);
void fileDataLog(LOGGER &logger);
void resetLogger(LOGGER &logger);
void sendFromMemoryLog(LOGGER &logger);
void captureGSMInfo();
void captureWiFiInfo();
void loadInitialConfigs();
void configDeviceFromWiFiConn(); //? get a better name
void initializeAndConfigGSM();
void commsManager();
bool isConnectivityAvailable();
bool pingServer(const char *server, uint16_t port, uint16_t timeout_ms);
void updateCommsPreference();
void initComms();
bool buildMQTTTelemetryPayload(char *mqtt_payload, size_t payload_size);
bool sendGsmMQTTTelemetry(const char *broker, uint16_t port, uint8_t client_id, const char *topic,
                          const char *username, const char *password);
bool initAndSendMQTTTelemetry(const char *broker, uint16_t port, const char *topic, uint8_t client_id,
                              const char *username, const char *password, bool disconnect_after);
bool sendWiFiMQTTTelemetry(const char *broker, uint16_t port, const char *client_id, const char *topic,
                           const char *username, const char *password);
void listenSerial();
void buildDeviceInfoJSON();
void checkIncomingMQTTMessages();
void wifiMQTTCallback(char *topic, byte *payload, unsigned int length);
void processIncomingData();

enum Month
{
    _JAN = 1,
    _FEB = 2,
    _MAR = 3,
    _APR = 4,
    _MAY = 5,
    _JUN = 6,
    _JUL = 7,
    _AUG = 8,
    _SEP = 9,
    _OCT = 10,
    _NOV = 11,
    _DEC = 12
};

int current_year, current_month = 0;

JsonDocument current_sensor_data;
bool time_to_send_telemetry = false;
bool is_boot_telemetry = false;
bool ha_pending_publish_data = false;

void setup()
{
    Serial.begin(115200);
    boottime = millis();
    DeviceConfigState.state = CONFIG_BOOT_INIT;

    uint64_t chipid_num;
    chipid_num = ESP.getEfuseMac();
    snprintf(esp_chipid, sizeof(esp_chipid), "%llX", chipid_num);
    delay(3000);
    Serial.print("ESP32 Chip ID: ");
    Serial.println(esp_chipid);
    strcpy(ROOT_DIR, "/");
    strcat(ROOT_DIR, SENSOR_PREFIX); //? Refactor to copy AP_SSID if it remains unchanged
    strcat(ROOT_DIR, esp_chipid);

    strcat(MQTT_TELEMETRY_TOPIC, MQTT_BASE_TOPIC);
    strcat(MQTT_TELEMETRY_TOPIC, "/");
    strcat(MQTT_TELEMETRY_TOPIC, SENSOR_PREFIX);
    strcat(MQTT_TELEMETRY_TOPIC, esp_chipid);
    // Set Dual Access Point and Station WiFi mode
    WiFi.mode(WIFI_AP_STA); // ToDo: Configure this when not on power saving mode.
    strcat(AP_SSID, SENSOR_PREFIX);
    strcat(AP_SSID, esp_chipid);

    init_memory_loggers();
    Serial.println("Initializing PMS5003 sensor");
    pms.init();
    delay(2000);
    pms.sleep();
    dht.setType(DHTTYPE);

    loadInitialConfigs(); // from global config file after compilation

    if (!LittleFS.begin(true))
    {
        Serial.println("An error has occurred while mounting LittleFS");
    }
    else
    {
        Serial.println("LittleFS mounted successfully. Attempting to override firmware configs with saved configs");
        // Override firmware configs with saveconfigs
        loadSavedDeviceConfigs(false);
        DeviceConfigState.configurationRequired = (!DeviceConfig.useGSM && !DeviceConfig.useWiFi);
    }

    // Device configuration

    if (DeviceConfigState.configurationRequired)
    {
        DeviceConfigState.configurationRequired = false; //? This will be reset by saveConfig()
        // Step 2: Start WiFi AP
        WiFi.softAP(AP_SSID, AP_PWD);
        Serial.print("struct_wifiInfo* wifiInfo size: ");
        Serial.println(max_wifi_hotspots_size);

        wifi_networks_scan(wifiInfo, count_wifiInfo);

        // Step 3: Start Captive Portal & Web Server
        DeviceConfigState.state = CONFIG_CAPTIVE_PORTAL_ACTIVE;
        DeviceConfigState.captivePortalStartTime = millis();
        DeviceConfigState.captivePortalTimeoutMs = 5 * 60 * 1000; // 5 minutes
        // DNS server for captive portal
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        setup_webserver();

        // ToDo: This should probably be spinned in another core
        startCaptivePortal(DeviceConfigState.captivePortalAccessed, DeviceConfigState.captivePortalStartTime, DeviceConfigState.captivePortalTimeoutMs);
    }
    else
    {

        WiFi.softAP(AP_SSID, AP_PWD); // start AP & webserver anyway
        setup_webserver();
    }

    // Check if a user entered new configs from the captive portal
    if (DeviceConfigState.configurationRequired)
    {
        Serial.println("Overriding current configs with captive portal configs");
        loadSavedDeviceConfigs(false);
        DeviceConfigState.configurationRequired = false;
    }

    initComms();

    // Home Assistant integration (MQTT Discovery over WiFi)
    if (DeviceConfigState.wifiConnected && DeviceConfigState.isHAConfigured && DeviceConfig.ha_enabled)
    {
        Serial.println("Initializing Home Assistant integration");
        haManager.setDeviceName(DeviceConfig.ha_device_name);
        haManager.setNodeId(SENSOR_PREFIX, esp_chipid);
        haManager.setConfig(DeviceConfig.ha_mqtt_broker, DeviceConfig.ha_mqtt_port,
                            DeviceConfig.ha_mqtt_username, DeviceConfig.ha_mqtt_password);

