CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
        // Register the sensor entities this firmware exposes. The manager stays
        // generic: it only stores keys/names/units, not what they measure.
        haManager.addSensor("temperature", "Temperature", "temperature", "°C", "mdi:thermometer");
        haManager.addSensor("humidity", "Humidity", "humidity", "%", "mdi:water-percent");
        haManager.addSensor("pm1", "PM1", "pm1", "µg/m³", "mdi:blur");
        haManager.addSensor("pm25", "PM2.5", "pm25", "µg/m³", "mdi:blur");
        haManager.addSensor("pm10", "PM10", "pm10", "µg/m³", "mdi:blur");

        haManager.begin();
        DeviceConfigState.isHAConnected = haManager.connect();
    }

// SD INIT
#ifdef REASSIGN_PINS
    SPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (SD_Init(SD_CS))
    {
#else
    if (SD_Init(-1))
    {
#endif

        SD_Attached = SDattached();
        DeviceConfigState.sdCardInitialized = SD_Attached;

        if (SD_Attached)
        {
            init_SD_loggers();
        }
    }
    else
    {
        DeviceConfigState.sdCardInitialized = false;
    }

    buildDeviceInfoJSON();
    starttime = millis();
}

// ToDo: introduce ESP light sleep mode
void loop()
{
#if defined(SERIAL_DEBUG) && SERIAL_DEBUG
    listenSerial();
#endif

    if (DeviceConfigState.configurationRequired)
    {

        loadSavedDeviceConfigs();
        if (DeviceConfigState.restartRequired)
        {
            Serial.println("New config(s) requries a restart. Restarting...\n\n");
            ESP.restart();
        }
        if (DeviceConfig.ha_enabled)
        {
            haManager.setConfig(DeviceConfig.ha_mqtt_broker, DeviceConfig.ha_mqtt_port,
                                DeviceConfig.ha_mqtt_username, DeviceConfig.ha_mqtt_password);
        }
        DeviceConfigState.configurationRequired = false;
    }
    // Manage communication device and connectivity state
    commsManager();

    act_milli = millis();

    if (DeviceConfig.power_saving_mode)
    {
        if (act_milli - last_read_sensors_data > sampling_interval && !send_now) // only send data after the memory logger is full
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
        }
    }
    else
    {
        send_now = act_milli - starttime > sending_intervall_ms;

        if (act_milli - last_read_sensors_data > sampling_interval)
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
            ha_pending_publish_data = true;
        }
    }

    if (send_now && CommsManagerState.preferredComm != CommsManagerState.PreferredComm::NONE)
    {

        init_SD_loggers(); // Refresh SD paths in case DeviceConfig.isLive changed at runtime.
        // Send data from memory loggers
        sendFromMemoryLog(JSON_PAYLOAD_LOGGER);
        // send payloads from the files that stores data that failed posting previously
        readSendDelete(SENSORS_FAILED_DATA_SEND_STORE_PATH);

        if (DeviceConfigState.gsmConnected && DeviceConfigState.gsmInternetAvailable)
        {
            modem.sleep();
        }

        starttime = millis();
    }

    if (DeviceConfigState.isMQTTConfigured && !CommsManagerState.allCommsUnavailable)
    {
        // Check if setup is complete and we haven't sent boot telemetry yet
        if (!boot_telemetry_sent && !DeviceConfigState.configurationRequired && millis() - boottime > BOOT_TELEMETRY_DELAY_MS)
        {
            time_to_send_telemetry = true;
            is_boot_telemetry = true;
            Serial.println("Time for boot telemetry send");
        }
        // Check if it's time for regular interval-based telemetry
        else if (millis() - last_send_telemetry > SEND_TELEMETRY_INTERVAL_MS)
        {
            time_to_send_telemetry = true;
            Serial.println("Time for regular interval telemetry send");
        }

        if (time_to_send_telemetry && (CommsManagerState.preferredComm != CommsManagerState.PreferredComm::NONE))
        {
            bool telemetry_sent = false;
            // Try WiFi MQTT first if WiFi is available
            if (DeviceConfigState.wifiConnected && WiFi.status() == WL_CONNECTED)
            {
                Serial.println("Sending telemetry via WiFi MQTT");
                telemetry_sent = sendWiFiMQTTTelemetry(MQTT_BROKER, MQTT_PORT, esp_chipid, MQTT_TELEMETRY_TOPIC, MQTT_USERNAME, MQTT_PASSWORD);
            }
            // Fall back to GSM MQTT if WiFi is not available but GSM is
            else if (DeviceConfigState.gsmConnected && DeviceConfigState.gsmInternetAvailable)
            {
                Serial.println("Sending telemetry via GSM MQTT");
                telemetry_sent = initAndSendMQTTTelemetry(MQTT_BROKER, MQTT_PORT, MQTT_TELEMETRY_TOPIC, MQTT_CLIENT_ID, MQTT_USERNAME, MQTT_PASSWORD, false);
            }
            else
            {
                Serial.println("No internet connectivity available for MQTT telemetry");
            }

            // Update telemetry tracking
            if (is_boot_telemetry && telemetry_sent && !boot_telemetry_sent)
            {
                boot_telemetry_sent = true;
                Serial.println("Boot telemetry sent successfully");
            }

            if (telemetry_sent)
                last_send_telemetry = millis();
            time_to_send_telemetry = false;
        }
    }
    if (CommsManagerState.message_received)
    {
        processIncomingData();
    }
    if (DeviceConfigState.isMQTTConfigured)
        checkIncomingMQTTMessages();

    // Maintain the Home Assistant MQTT connection and publish current sensor data if connected
    if (DeviceConfigState.wifiConnected && DeviceConfigState.isHAConfigured && DeviceConfig.ha_enabled)
    {
        haManager.loop();
        DeviceConfigState.isHAConnected = haManager.isConnected();

        if (ha_pending_publish_data)
        {
            bool published = false;

            JsonVariantConst dht = current_sensor_data["DHT"];
            if (!dht.isNull())
            {
                if (!dht["temperature"].isNull())
                    published |= haManager.publishState("temperature", dht["temperature"].as<float>());
                if (!dht["humidity"].isNull())
                    published |= haManager.publishState("humidity", dht["humidity"].as<float>());
            }

            JsonVariantConst pm = current_sensor_data["PM"];
            if (!pm.isNull())
            {
                if (!pm["PM1"].isNull())
                    published |= haManager.publishState("pm1", pm["PM1"].as<float>());
                if (!pm["PM2.5"].isNull())
                    published |= haManager.publishState("pm25", pm["PM2.5"].as<float>());
                if (!pm["PM10"].isNull())
                    published |= haManager.publishState("pm10", pm["PM10"].as<float>());
            }

            if (published)
                ha_pending_publish_data = false;
        }
    }

    if (millis() - boottime > DURATION_BEFORE_FORCED_RESTART_MS)
    {
        ESP.restart();
    }
}

