CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
void readDHT()
{

    delay(2000);
    char resultDHT[255] = {};
    Serial.print("Reading DHT22...");
    uint32_t start = millis();
    int chk = dht.read();
    uint32_t stop = millis();

    switch (chk)
    {
    case DHTLIB_OK:
    {
        uint32_t duration = stop - start;
        Serial.print("DHT read duration: ");
        Serial.println(duration);
        char buf[128] = {};
        float temperature = dht.getTemperature();
        float humidity = dht.getHumidity();
        String datetime = getRTCdatetimetz(ISO_time_format, esp_datetime_tz.timezone);
        sprintf(buf, "Temperature %0.1f C, Humidity %0.1f %% RH", temperature, humidity);

        Serial.println(buf);
        if (datetime != "")
        {
            updateCalendarFromRTC(); // In case we roll into a new year or month.
            // Generate JSON data
            JsonDocument DHT_data_doc;
            JsonArray DHT_data = DHT_data_doc.to<JsonArray>();
            add_value2JSON_array(DHT_data, "temperature", temperature);
            add_value2JSON_array(DHT_data, "humidity", humidity);
            // serializeJsonPretty(DHT_data_doc, Serial);
            generateJSON_payload(resultDHT, DHT_data_doc, datetime.c_str(), SensorAPI_PIN::DHT, sizeof(resultDHT));
            memoryDataLog(JSON_PAYLOAD_LOGGER, resultDHT);

            // Generate CSV data and log to memory
            generateCSV_payload(resultDHT, sizeof(resultDHT), datetime.c_str(), "temperature", temperature, "°C", "DHT22");
            generateCSV_payload(resultDHT, sizeof(resultDHT), datetime.c_str(), "humidity", humidity, "%", "DHT22");
            memoryDataLog(CSV_PAYLOAD_LOGGER, resultDHT);

            // update current sensor data
            JsonObject dht_obj = DHT_data_doc.to<JsonObject>();
            dht_obj["temperature"] = temperature;
            dht_obj["humidity"] = humidity;
            current_sensor_data["DHT"] = dht_obj;
            serializeJsonPretty(current_sensor_data, Serial);
        }

        break;
    }
    case DHTLIB_ERROR_CHECKSUM:
        Serial.print("Checksum error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_A:
        Serial.print("Time out A error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_B:
        Serial.print("Time out B error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_C:
        Serial.print("Time out C error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_D:
        Serial.print("Time out D error,\t");
        break;
    case DHTLIB_ERROR_SENSOR_NOT_READY:
        Serial.print("Sensor not ready,\t");
        break;
    case DHTLIB_ERROR_BIT_SHIFT:
        Serial.print("Bit shift error,\t");
        break;
    case DHTLIB_WAITING_FOR_READ:
        Serial.print("Waiting for read,\t");
        break;
    default:
        Serial.print("Unknown: ");
        Serial.print(chk);
        Serial.print(",\t");
        break;
    }
}

void getPMSREADINGS()
{
    pms.wake();
    delay(30000); // wait for 30 seconds warm-up to get an accurate reading

    // pms.sleep();
    char result_PMS[255] = {};
    pms.read();
    if (pms) // Successfull read
    {
        pms.sleep();
        String datetime = getRTCdatetimetz(ISO_time_format, esp_datetime_tz.timezone);

        // print the results
        printPM_values();

        if (datetime == "") // ! extra validation needed now that RTC is being used
        {
            Serial.println("Datetime is empty...discarding data point");
        }
        else
        {
            updateCalendarFromRTC(); // In case we roll into a new year or month.

            // Generate JSON data
            JsonDocument PM_data_doc;
            JsonArray PM_data = PM_data_doc.to<JsonArray>();

            add_value2JSON_array(PM_data, "P0", pms.pm01);
            add_value2JSON_array(PM_data, "P1", pms.pm10);
            add_value2JSON_array(PM_data, "P2", pms.pm25);

            // serializeJsonPretty(PM_data_doc, Serial);
            generateJSON_payload(result_PMS, PM_data_doc, datetime.c_str(), SensorAPI_PIN::PMS, sizeof(result_PMS));

            memoryDataLog(JSON_PAYLOAD_LOGGER, result_PMS);

            // Generate CSV data and log to memory

            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM0", pms.pm01, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);
            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM2.5", pms.pm25, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);
            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM10", pms.pm10, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);

            // update current sensor data
            JsonObject pm_obj = PM_data_doc.to<JsonObject>();
            pm_obj["PM2.5"] = pms.pm25;
            pm_obj["PM10"] = pms.pm10;
            pm_obj["PM1"] = pms.pm01;

            current_sensor_data["PM"] = pm_obj;
        }
    }
    else // something went wrong
    {
        pms.sleep();
        printPM_Error();
    }
}

void printPM_values()
{
    Serial.print(F("PM1.0 "));
    Serial.print(pms.pm01);
    Serial.print(F(", "));
    Serial.print(F("PM2.5 "));
    Serial.print(pms.pm25);
    Serial.print(F(", "));
    Serial.print(F("PM10 "));
    Serial.print(pms.pm10);
    Serial.println(F(" [ug/m3]"));
}

void printPM_Error()
{
    Serial.print(F("Error reading PMS5003 sensor: "));
    switch (pms.status)
    {
    case pms.OK: // should never come here
        break;   // included to compile without warnings
    case pms.ERROR_TIMEOUT:
        Serial.println(F(PMS_ERROR_TIMEOUT));
        break;
    case pms.ERROR_MSG_UNKNOWN:
        Serial.println(F(PMS_ERROR_MSG_UNKNOWN));
        break;
    case pms.ERROR_MSG_HEADER:
        Serial.println(F(PMS_ERROR_MSG_HEADER));
        break;
    case pms.ERROR_MSG_BODY:
        Serial.println(F(PMS_ERROR_MSG_BODY));
        break;
    case pms.ERROR_MSG_START:
        Serial.println(F(PMS_ERROR_MSG_START));
        break;
    case pms.ERROR_MSG_LENGTH:
        Serial.println(F(PMS_ERROR_MSG_LENGTH));
        break;
    case pms.ERROR_MSG_CKSUM:
        Serial.println(F(PMS_ERROR_MSG_CKSUM));
        break;
    case pms.ERROR_PMS_TYPE:
        Serial.println(F(PMS_ERROR_PMS_TYPE));
        break;
    }
}

/**
    @brief Generate JSON payload
    @param res : buffer to store the generated JSON payload
    @param data : JSON document containing the sensor data
    @param timestamp : timestamp of the data
    @param pin : sensor pin type as configured in the API
    @param size : size of the buffer
    @return : void
**/
void generateJSON_payload(char *res, JsonDocument &data, const char *timestamp, SensorAPI_PIN pin, size_t size)
{
    JsonDocument payload;

    payload["software_version"] = "NRZ-2020-129";
    payload["timestamp"] = timestamp;
    payload["sensordatavalues"] = data;

