CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // char sensor_type[24] = ",\"type\":\"";
    switch (pin)
    {
    case SensorAPI_PIN::PMS:
        // strcat(res, "PMS\"");
        payload["sensor_type"] = "PMS";
        payload["API_PIN"] = pin;
        break;
    case SensorAPI_PIN::DHT:
        // strcat(res, "DHT\"");
        payload["sensor_type"] = "DHT";
        payload["API_PIN"] = pin;
        break;
    default:
        Serial.println("Unsupported sensor pin");
        break;
    }

    serializeJson(payload, res, size);
}

datetimetz extractDateTime(String datetimeStr)
{
    datetimetz dtz;
    dtz.datetime = {0, 0, 0, 0, 0, 0, 0};
    dtz.timestamp = 0;

    // Serial.println("Received date string: " + datetimeStr); //! format looks like "25/02/24,05:55:53+00" and may include the quotes!

    // check if received string is empty
    if (datetimeStr == "")
    {
        Serial.println("Datetime string is empty");

        return dtz;
    }

    // check if the datetime string has leading or trailing quotes
    if (datetimeStr[0] == '"', datetimeStr[datetimeStr.length() - 1] == '"')
    {
        // remove the first and last character of the string (")
        datetimeStr = datetimeStr.substring(1, datetimeStr.length() - 1);
    }

    // Parse the datetime string

    int _year = datetimeStr.substring(0, 2).toInt();
    int _month = datetimeStr.substring(3, 5).toInt();
    int _day = datetimeStr.substring(6, 8).toInt();
    int _hour = datetimeStr.substring(9, 11).toInt();
    int _minute = datetimeStr.substring(12, 14).toInt();
    int _second = datetimeStr.substring(15, 17).toInt();

    // perform sanity check on the parsed values
    if (_year < 0 || _year > 99 || _month < 1 || _month > 12 || _day < 1 || _day > 31 ||
        _hour < 0 || _hour > 23 || _minute < 0 || _minute > 59 || _second < 0 || _second > 59)
    {
        Serial.println("Invalid date/time values");
        return dtz;
    }

#if defined(QUECTEL)

    // time zone = indicates the difference, expressed in quarters of an hour, between the local time and GMT; range: -48 to +56)
    int tz = datetimeStr.substring(18).toInt() / 4;
    String timezone = datetimeStr.substring(17, 18); // extract timezone sign
    if (tz < 10)
    {
        timezone += "0" + String(tz);
    }
    else
    {
        timezone += String(tz);
    }
#else
    String timezone = datetimeStr.substring(17); // +00

#endif
    strncpy(dtz.timezone, timezone.c_str(), 6); // copy timezone to the provided buffer

    Serial.println("Day: " + String(_day));
    Serial.println("Month: " + String(_month));
    Serial.println("Year: " + String(_year));
    Serial.println("Hour: " + String(_hour));
    Serial.println("Minute: " + String(_minute));
    Serial.println("Second: " + String(_second));

    // Adjust year for TimeLib (TimeLib expects years since 1970)
    _year += 2000; // Assuming 24 is 2024
    _year -= 1970;

    dtz.datetime.Second = _second;
    dtz.datetime.Minute = _minute;
    dtz.datetime.Hour = _hour;
    dtz.datetime.Day = _day;
    dtz.datetime.Month = _month;
    dtz.datetime.Year = _year;

    // Create a time_t value
    dtz.timestamp = makeTime(dtz.datetime);
    Serial.print("Parsed timestamp: ");
    Serial.println(dtz.timestamp); // Print the time_t value

    return dtz;
}

String formatDateTime(time_t t, String timezone)
{
    String yearStr = String(year(t)); // Adjust year back to 20xx
    String monthStr = String(month(t));
    String dayStr = String(day(t));
    String hourStr = String(hour(t));
    String minuteStr = String(minute(t));
    String secondStr = String(second(t));

    // Pad with leading zeros if necessary
    if (monthStr.length() == 1)
        monthStr = "0" + monthStr;
    if (dayStr.length() == 1)
        dayStr = "0" + dayStr;
    if (hourStr.length() == 1)
        hourStr = "0" + hourStr;
    if (minuteStr.length() == 1)
        minuteStr = "0" + minuteStr;
    if (secondStr.length() == 1)
        secondStr = "0" + secondStr;

    return yearStr + "-" + monthStr + "-" + dayStr + "T" + hourStr + ":" + minuteStr + ":" + secondStr + timezone;
}

String getRTCdatetimetz(const char *format, char *timezone)
{
    if (!DeviceConfigState.timeSet)
    {
        return "";
    }
    String datetimetz = RTC.getTime(format);
    datetimetz += timezone;
    return datetimetz;
}

/*****************************************************************
 * send data via WiFi                                            *
 *****************************************************************/
/**
    @brief: Send data to the server via WiFi
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param url : full URL of the server endpoint
    @return: true if data is sent successfully, false otherwise
**/
bool sendDataViaWiFi(const char *data, const int _pin, const char *url)
{
    if (!DeviceConfigState.wifiConnected || !DeviceConfigState.wifiInternetAvailable)
    {
        Serial.println("WiFi not connected or no internet available");
        return false;
    }

    char host[128];
    char path[256];
    uint16_t port;
    bool useWiFiSecure;

    if (!parseURL(url, host, sizeof(host), port, path, sizeof(path), useWiFiSecure))
    {
        log_e("URL parsing failed");
        return false;
    }
    // ToDo: Refactor to use WiFiClientSecure if useWiFiSecure is true. This will require additional handling for certificates and may increase memory usage significantly, so it should be implemented with care.

    WiFiClient client;
    char pin[4];
    itoa(_pin, pin, 10);

    // Build HTTP request
    char http_headers[3][40] = {};
    strcat(http_headers[0], "X-PIN: ");
    strcat(http_headers[0], pin);

    strcat(http_headers[1], "X-Sensor: ");
    strcat(http_headers[1], SENSOR_PREFIX);
    strcat(http_headers[1], esp_chipid);
    strcat(http_headers[2], "Content-Type: application/json");

    // Connect to server
    if (!client.connect(host, PORT_CFA))
    {
        Serial.println("WiFi: Failed to connect to server");
        return false;
    }

    // Build HTTP POST request
    String http_request = "POST ";
    http_request += path;
    http_request += " HTTP/1.1\r\n";
    http_request += "Host: ";
    http_request += host;
    http_request += "\r\n";
    http_request += "Content-Length: ";
    http_request += strlen(data);
    http_request += "\r\n";
    http_request += http_headers[0]; // X-PIN
    http_request += "\r\n";
    http_request += http_headers[1]; // X-Sensor
    http_request += "\r\n";
    http_request += http_headers[2]; // Content-Type
    http_request += "\r\n";
    http_request += "Connection: close\r\n";
    http_request += "\r\n";
    http_request += data;

    // Send the request
    client.print(http_request);

