CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // Wait for response and check status code
    unsigned long timeout = millis() + 10000; // 10 second timeout
    uint16_t statuscode = 0;
    bool parsing_status = false;

    while (client.connected() && millis() < timeout)
    {
        String line = client.readStringUntil('\n');
        if (line.length() == 0)
            break;

        // Parse HTTP status code (first line: HTTP/1.1 200 OK)
        if (!parsing_status && line.startsWith("HTTP/1."))
        {
            int space_pos = line.indexOf(' ');
            if (space_pos > 0)
            {
                String status_str = line.substring(space_pos + 1, space_pos + 4);
                statuscode = status_str.toInt();
                parsing_status = true;
                Serial.print("WiFi: HTTP Status Code: ");
                Serial.println(statuscode);
            }
        }
    }

    client.stop();

    if (statuscode == 200 || statuscode == 201)
    {
        Serial.println("WiFi: Data sent successfully");
        return true;
    }
    else
    {
        Serial.println("WiFi: Data send failed with HTTP status: " + String(statuscode));
        return false;
    }
}

// bool sendDataViaGSM(const char *data, const int _pin, const char *url)
// {
//     return sendDataViaGSM(data, _pin, GSM_HOST, url);
// }

/*****************************************************************
 * send data via GSM                                             *
 *****************************************************************/
/**
    @brief: Send data to the server via GSM/GPRS
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param url : full URL of the server endpoint
    @return: true if data is sent successfully, false otherwise
**/
bool sendDataViaGSM(const char *data, const int _pin, const char *url)
{
    if (!gsm_capable || !DeviceConfigState.gsmInternetAvailable || !modem.state().gprsConnected)
    {
        Serial.println("GSM not capable or GPRS not connected");
        return false;
    }

    char pin[4];
    itoa(_pin, pin, 10);

#ifdef QUECTEL
    char http_headers[3][256] = {};
    strcat(http_headers[0], "X-PIN: ");
    strcat(http_headers[0], pin);

    strcat(http_headers[1], "X-Sensor: ");
    strcat(http_headers[1], SENSOR_PREFIX);
    strcat(http_headers[1], esp_chipid);
    strcat(http_headers[2], "Content-Type: application/json");

    const int statuscode = modem.post(url, http_headers, 3, data, strlen(data));

    if (statuscode == 200 || statuscode == 201)
    {
        Serial.println("GSM: Data sent successfully");
        return true;
    }
    else
    {
        Serial.println("GSM: Data send failed with HTTP status: " + String(statuscode));
        return false;
    }

    // ToDo: close HTTP session/ PDP context
#else
    return false;
#endif
}

/*****************************************************************
 * send data to rest api with fallback                           *
 *****************************************************************/
/**
    @brief: Send data to the server with communication priority and fallback
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param url : url path to send the data
    @return: true if data is sent successfully via any method, false otherwise
    @note: Respects CommunicationPriority order and attempts fallback method if primary fails
**/
bool sendData(const char *data, const int _pin, const char *url)
{
    bool send_result = false;

    // Check if any communication method is available
    if (CommsManagerState.allCommsUnavailable)
    {
        Serial.println("SendData: All communication methods are unavailable - data will be stored for later transmission");
        return false;
    }

    // Use preferred communication method determined by CommsManager
    switch (CommsManagerState.preferredComm)
    {
    case CommsManagerState.PreferredComm::WIFI:
        if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
        {
            Serial.println("SendData: Attempting WiFi (preferred)...");
            send_result = sendDataViaWiFi(data, _pin, url);

            if (send_result)
            {
                return true;
            }

            // WiFi failed, try GSM fallback
            CommsManagerState.wifiFailCount++;
            Serial.println("SendData: WiFi failed, attempting GSM fallback...");

            if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
            {
                send_result = sendDataViaGSM(data, _pin, url);
                if (send_result)
                {
                    CommsManagerState.wifiFailCount = 0; // Reset on success
                    return true;
                }
                CommsManagerState.gsmFailCount++;
            }
        }
        break;

    case CommsManagerState.PreferredComm::GSM:
        if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
        {
            Serial.println("SendData: Attempting GSM (preferred)...");
            send_result = sendDataViaGSM(data, _pin, url);

            if (send_result)
            {
                return true;
            }

            // GSM failed, try WiFi fallback
            CommsManagerState.gsmFailCount++;
            Serial.println("SendData: GSM failed, attempting WiFi fallback...");

            if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
            {
                send_result = sendDataViaWiFi(data, _pin, url);
                if (send_result)
                {
                    CommsManagerState.gsmFailCount = 0; // Reset on success
                    return true;
                }
                CommsManagerState.wifiFailCount++;
            }
        }
        break;

    case CommsManagerState.PreferredComm::NONE:
        // No preferred comms available, attempt either if configured
        if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
        {
            Serial.println("SendData: Attempting WiFi (no preferred)...");
            send_result = sendDataViaWiFi(data, _pin, url);
            if (send_result)
                return true;
            CommsManagerState.wifiFailCount++;
        }

        if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
        {
            Serial.println("SendData: Attempting GSM (no preferred)...");
            send_result = sendDataViaGSM(data, _pin, url);
            if (send_result)
                return true;
            CommsManagerState.gsmFailCount++;
        }
        break;
    }

    if (!send_result)
    {
        Serial.println("SendData: Data transmission failed via all available methods - will retry later");
    }

    return send_result;
}

void init_memory_loggers()
{
    // Initialize memory loggers
    JSON_PAYLOAD_LOGGER.name = "JSON";
    JSON_PAYLOAD_LOGGER.path = SENSORS_JSON_DATA_PATH;
    JSON_PAYLOAD_LOGGER.type = DATA_LOGGERS::JSON;

