CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // close files
    closeFile(SD, datafile);
}

void updateCalendarFromRTC()
{
    bool calendarUpdated = false;
    int year = RTC.getYear();
    int month = RTC.getMonth() + 1; // ESP32Time month is 0 based

    if (year > current_year)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_year);
        Serial.print(" to: ");
        Serial.println(year);

        current_year = year;
        current_month = month; // Also update the month. Ideally, Jan.
        calendarUpdated = true;
    }
    else if (month > current_month)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_month);
        Serial.print(" to: ");
        Serial.println(month);

        current_month = month;
        calendarUpdated = true;
    }
    if (calendarUpdated)
    {
        init_SD_loggers();
    }
}

void initCalender(int year, int month)
{
    Serial.print("Initializing calendar with year: ");
    Serial.print(year);
    Serial.print(" and month: ");
    Serial.println(month);
    if (year != 0 && month != 0)
    {
        current_year = year;
        current_month = month;
    }
}

/**
    @brief Log data to memory
    @param logger : logger to log the data to
    @param data : data to log
    @return : void
    @note : The function will log the data to the logger. If the logger is full, it will append the data to a file.
**/
void memoryDataLog(LOGGER &logger, const char *data)
{

    if (logger.log_count < logger.MAX_ENTRIES)
    {
        strcpy(logger.DATA_STORE[logger.log_count], data);
        Serial.println("Logged data: " + String(logger.DATA_STORE[logger.log_count]));
        logger.log_count++;
    }
    else
    {
        Serial.println("Logger data log count exceeded for " + String(logger.name));
        switch (logger.type)
        {
        case DATA_LOGGERS::JSON:
            // Append to JSON file
            fileDataLog(logger);
            send_now = true;
            break;
        case DATA_LOGGERS::CSV:
            fileDataLog(logger);
            resetLogger(logger);
            break;
        }
    }
}

/**
    @brief Log data to file
    @param logger : logger to log the data to
    @return : void
    @note : The function will log the data to the file. If the file is full, it will append the data to a new file.
**/
void fileDataLog(LOGGER &logger)
{
    refreshLoggerPath(logger);
    Serial.println("Logging data to file: " + String(logger.path));
    for (int i = 0; i < logger.MAX_ENTRIES; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            appendFile(SD, logger.path, logger.DATA_STORE[i]);
        }
    }
}

/**
    @brief Reset logger
    @param logger : logger to reset
    @return : void
    @note : The function will reset the logger. It will clear the data store and set the log count to 0.
**/
void resetLogger(LOGGER &logger)
{
    logger.log_count = 0;
    memset(logger.DATA_STORE, 0, sizeof(logger.DATA_STORE));
}

/**
    @brief Send data from memory loggers
    @param logger : logger to send data from
    @return : void
    @note : The function will send the data from the logger. If the send fails, the data will be appended to a file for later sending.
**/
void sendFromMemoryLog(LOGGER &logger)
{
    for (int i = 0; i < logger.log_count; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            JsonDocument doc;
            deserializeJson(doc, logger.DATA_STORE[i]); // Extract API_PIN from the JSON data
            int api_pin = doc["API_PIN"] | -1;
            if (api_pin != -1)
            {
                if (!sendData(logger.DATA_STORE[i], api_pin, DeviceConfig.active_api_url))
                {
                    // Append to file for sending later // ToDo: Check the state of DeviceConfigState.sdCardInitialized before attempting to write to SD card
                    appendFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, logger.DATA_STORE[i]);
                }
            }

            memset(logger.DATA_STORE[i], '\0', 255);
        }
    }
    logger.log_count = 0;

    //? call resetLogger(logger) to reset the logger
    //? or just clear the memory
}

// Get current sensor data;

JsonDocument getCurrentSensorData()
{
    return current_sensor_data;
}

void captureGSMInfo()
{
    // ToDo: Reduce memory footprint by moving global gsm_info doc to  scoped local variable asyncwebserver
    gsm_info["Network Name"] = gsmRuntimeInfo.operatorName = modem.networkName();
    gsm_info["Signal Strength"] = gsmRuntimeInfo.signalStrength = modem.signalStrength();
    strcpy(gsmRuntimeInfo.simCcid, modem.state().simCcid);
    gsm_info["SIM ICCID"] = gsmRuntimeInfo.simCcid;
    gsm_info["Model ID"] = gsmRuntimeInfo.modelId = modem.modelId();
    gsm_info["Firmware Version"] = gsmRuntimeInfo.firmwareVersion = modem.firmwareVersion();
    gsm_info["IMEI"] = gsmRuntimeInfo.imei = modem.imei();
}

void configDeviceFromWiFiConn()
{

    captureWiFiInfo();

    if (!DeviceConfigState.timeSet)
    {
        // synchronise system clock over NTP
        configTime(0, 0, "pool.ntp.org", "time.nist.gov");
        time_t now = time(nullptr);
        RTC.setTime(now);
        initCalender(RTC.getYear(), RTC.getMonth() + 1);
        DeviceConfigState.timeSet = true;
    }
}

void captureWiFiInfo()
{
    wifi_info["SSID"] = WiFi.SSID();
    wifi_info["BSSID"] = WiFi.BSSIDstr();
    wifi_info["Signal Strength"] = WiFi.RSSI();
    wifi_info["IP Address"] = WiFi.localIP().toString();
}

/**
    @brief Initialize and configure GSM module
    @details This function handles GSM serial initialization, GSM module initialization,
             network registration with timeout, GPRS initialization, time fetching, and puts GSM to sleep.
    @return : void
**/
void initializeAndConfigGSM()
{
    DeviceConfigState.state = ConfigurationState::CONFIG_GSM;
    DeviceConfigState.gsmInternetAvailable = false;
    CommsManagerState.gsmOnline = false;
    CommsManagerState.allCommsUnavailable = !CommsManagerState.wifiOnline;
    CommsManagerState.mqttConnectionInitialized = mqttClient.connected();
    gsmMqttSubscriptionReady = false;

    // The UART is shared with modemAt. initialize() owns software reset and
    // hardware recovery, including when this initial AT probe fails.
    if (!modem.beginSerial(modemSerial))
        Serial.println("Initial modem communication unavailable; attempting recovery");

    DeviceConfigState.gsmConnected = modem.initialize();
    if (!DeviceConfigState.gsmConnected)
        return;

    // Store the CA certificate in the modem's UFS.
    if (!modem.fileSystem().exists(MOZILLA_PEM_FILENAME))
    {
        Serial.print("Writing modem file: ");
        Serial.println(MOZILLA_PEM_FILENAME);

        if (!modem.fileSystem().writeText(MOZILLA_PEM_FILENAME, MOZILLA_CA_BUNDLE))
        {
            Serial.println("Failed to write to file");
        }
        else
        {
            if (!modem.setCaCertificate(MOZILLA_PEM_FILENAME))
            {
                Serial.println("Failed to set CA certificate for secure connections");
            }
        }
    }
    else
    {
        if (!modem.setCaCertificate(MOZILLA_PEM_FILENAME))
        {
            Serial.println("Failed to set CA certificate for secure connections");
        }
    }

    if (!modemAt.synchronized())
    {
        Serial.println("Modem file transfer lost synchronization; retry GSM initialization");
        DeviceConfigState.gsmConnected = false;
        return;
    }

    const gsm::NetworkMode modes[] = {gsm::NetworkMode::Auto, gsm::NetworkMode::G2, gsm::NetworkMode::G4};
    bool network_registered = false;

    for (auto mode : modes)
    {
        if (modem.setNetworkMode(mode) && modem.registerToNetwork())
        {
            network_registered = true;
            break;
        }
    }

    if (!network_registered)
    {
        Serial.println("Failed to register to GSM network");
        return;
    }

    // GPRS initialization
    DeviceConfigState.gsmInternetAvailable = modem.initializeGprs();
    CommsManagerState.gsmOnline = DeviceConfigState.gsmInternetAvailable;
    CommsManagerState.allCommsUnavailable = !(CommsManagerState.wifiOnline || CommsManagerState.gsmOnline);

    // Fetch network time and update RTC
    if (!DeviceConfigState.timeSet)
    {
        if (modem.getNetworkTime(time_buff, sizeof(time_buff)))
        {
            // Update RTC time and calendar
            Serial.println("GSM Network Time: " + String(time_buff));
            esp_datetime_tz = extractDateTime(String(time_buff));
            RTC.setTime(esp_datetime_tz.timestamp);
            initCalender(RTC.getYear(), RTC.getMonth() + 1);
            DeviceConfigState.timeSet = true;
        }
        else
        {
            Serial.println("Failed to fetch time from network");
        }
    }
    if (DeviceConfigState.gsmInternetAvailable && DeviceConfigState.isMQTTConfigured)
    {
        // initialize() reset the modem, so any previous GSM MQTT session is gone.
        const bool mqttReady = gsmMqtt.configure(MQTT_CLIENT_ID, 1, 1) &&
                               gsmMqtt.open(MQTT_CLIENT_ID, MQTT_BROKER, MQTT_PORT) &&
                               gsmMqtt.connect(MQTT_CLIENT_ID, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD) &&
                               gsmMqtt.subscribe(MQTT_CLIENT_ID, 1, MQTT_SUBSCRIBE_TOPIC, 0);
        gsmMqttSubscriptionReady = mqttReady;
        CommsManagerState.mqttConnectionInitialized = mqttClient.connected() || mqttReady;
    }
    captureGSMInfo();
    modem.sleep();
}

void loadInitialConfigs()
{

