CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
#if defined(POWER_SAVING_MODE)
    DeviceConfig.power_saving_mode = POWER_SAVING_MODE;
#endif
#if defined(GSM_APN)
    strncpy(DeviceConfig.gsm_apn, GSM_APN, sizeof(DeviceConfig.gsm_apn) - 1);
    DeviceConfig.gsm_apn[sizeof(DeviceConfig.gsm_apn) - 1] = '\0';
#endif
#if defined(GSM_APN_PWD)
    strncpy(DeviceConfig.gsm_apn_pwd, GSM_APN_PWD, sizeof(DeviceConfig.gsm_apn_pwd) - 1);
    DeviceConfig.gsm_apn_pwd[sizeof(DeviceConfig.gsm_apn_pwd) - 1] = '\0';
#endif
#if defined(WIFI_STA_SSID)
    strncpy(DeviceConfig.wifi_sta_ssid, WIFI_STA_SSID, sizeof(DeviceConfig.wifi_sta_ssid) - 1);
    DeviceConfig.wifi_sta_ssid[sizeof(DeviceConfig.wifi_sta_ssid) - 1] = '\0';
#endif
#if defined(WIFI_STA_PWD)
    strncpy(DeviceConfig.wifi_sta_pwd, WIFI_STA_PWD, sizeof(DeviceConfig.wifi_sta_pwd) - 1);
    DeviceConfig.wifi_sta_pwd[sizeof(DeviceConfig.wifi_sta_pwd) - 1] = '\0';
#endif
#if defined(GSM_PIN)
    strncpy(DeviceConfig.sim_pin, GSM_PIN, sizeof(DeviceConfig.sim_pin) - 1);
    DeviceConfig.sim_pin[sizeof(DeviceConfig.sim_pin) - 1] = '\0';
#endif

    if (gsm_capable)
        DeviceConfig.useGSM = use_gsm;

    DeviceConfig.useWiFi = use_wifi;

    if (!DeviceConfig.useWiFi && !DeviceConfig.useGSM)
        DeviceConfigState.configurationRequired = true;

#if defined(MQTT_BROKER) && defined(MQTT_USERNAME) && defined(MQTT_PASSWORD)
    if (MQTT_BROKER[0] != '\0' && MQTT_USERNAME[0] != '\0' && MQTT_PASSWORD[0] != '\0')
    {
        DeviceConfigState.isMQTTConfigured = true;
    }
#endif

    strcpy(DeviceConfig.production_url, PRODUCTION_URL);
    strcpy(DeviceConfig.staging_url, STAGING_URL);

#if defined(IS_LIVE)
    DeviceConfig.isLive = (IS_LIVE != 0);
    if (DeviceConfig.isLive)
    {
        strcpy(DeviceConfig.active_api_url, DeviceConfig.production_url);
    }
    else
    {
        strcpy(DeviceConfig.active_api_url, DeviceConfig.staging_url);
    }
#else
    DeviceConfig.isLive = false;
    strcpy(DeviceConfig.active_api_url, DeviceConfig.staging_url);
#endif

#if defined(HA_ENABLE)
    DeviceConfig.ha_enabled = (HA_ENABLE != 0);
#endif
#if defined(HA_MQTT_BROKER)
    strncpy(DeviceConfig.ha_mqtt_broker, HA_MQTT_BROKER, sizeof(DeviceConfig.ha_mqtt_broker) - 1);
    DeviceConfig.ha_mqtt_broker[sizeof(DeviceConfig.ha_mqtt_broker) - 1] = '\0';
#endif
#if defined(HA_MQTT_PORT)
    DeviceConfig.ha_mqtt_port = HA_MQTT_PORT;
#endif
#if defined(HA_MQTT_USERNAME)
    strncpy(DeviceConfig.ha_mqtt_username, HA_MQTT_USERNAME, sizeof(DeviceConfig.ha_mqtt_username) - 1);
    DeviceConfig.ha_mqtt_username[sizeof(DeviceConfig.ha_mqtt_username) - 1] = '\0';
#endif
#if defined(HA_MQTT_PASSWORD)
    strncpy(DeviceConfig.ha_mqtt_password, HA_MQTT_PASSWORD, sizeof(DeviceConfig.ha_mqtt_password) - 1);
    DeviceConfig.ha_mqtt_password[sizeof(DeviceConfig.ha_mqtt_password) - 1] = '\0';
#endif

    DeviceConfigState.isHAConfigured = (DeviceConfig.ha_enabled && DeviceConfig.ha_mqtt_broker[0] != '\0');
    Serial.println("Firmware Device Configs:");
    Serial.print("  wifi_sta_ssid: ");
    Serial.println(DeviceConfig.wifi_sta_ssid);
    Serial.print("  wifi_sta_pwd: ");
    Serial.println(DeviceConfig.wifi_sta_pwd);
    Serial.print("  gsm_apn: ");
    Serial.println(DeviceConfig.gsm_apn);
    Serial.print("  gsm_apn_pwd: ");
    Serial.println(DeviceConfig.gsm_apn_pwd);
    Serial.print("  sim_pin: ");
    Serial.println(DeviceConfig.sim_pin);
    Serial.print("  power_saving_mode: ");
    Serial.println(DeviceConfig.power_saving_mode ? "true" : "false");
    Serial.print("  useWiFi: ");
    Serial.println(DeviceConfig.useWiFi ? "true" : "false");
    Serial.print("  useGSM: ");
    Serial.println(DeviceConfig.useGSM ? "true" : "false");
    Serial.print("  isLive: ");
    Serial.println(DeviceConfig.isLive ? "true" : "false");
    Serial.print("  active_api_url: ");
    Serial.println(DeviceConfig.active_api_url);
    Serial.print("  staging_url: ");
    Serial.println(DeviceConfig.staging_url);
    Serial.print("  production_url: ");
    Serial.println(DeviceConfig.production_url);

    // if (DeviceConfig.power_saving_mode)
    //     {
    //         sampling_interval = 15 * 60 * 1000; // 15 minutes
    //         sending_intervall_ms = 60 * 60 * 1000; // 1 hour
    //     }
    // else
    //     {
    //         sampling_interval = 1 * 60 * 1000; // 1 minute
    //         sending_intervall_ms = 5 * 60 * 1000; // 5 minutes
    //     }
}

/**
 * @brief Ping a server to verify internet connectivity
 * @param server : Server address/hostname to ping
 * @param port : Port number (typically 80 for HTTP, 443 for HTTPS)
 * @param timeout_ms : Timeout in milliseconds
 * @return : true if ping successful, false otherwise
 * @note : This function simplistically checks connectivity by attempting a TCP connection
 */
bool pingServer(const char *server, uint16_t port, uint16_t timeout_ms)
{
    if (server == nullptr)
        return false;

    // Try WiFi if available
    if (DeviceConfig.useWiFi && DeviceConfigState.wifiConnected)
    {
        bool wifi_internet_access = wifiHasInternet(server, port, timeout_ms);
        if (wifi_internet_access)
        {
            return true;
        }
    }

    // Try GSM if WiFi failed and GSM is available
    if (DeviceConfig.useGSM && DeviceConfigState.gsmConnected && modem.state().gprsConnected)
    {
        bool ping_success = modem.pingIp(server);

        if (ping_success)
            return true;
    }

    return false;
}

/**
 * @brief Check if any communication method has internet connectivity
 * @details Attempts to ping a known server to verify actual internet availability
 *          Updates DeviceConfigState.wifiOnline and gsmOnline flags
 * @return : true if any communication is available, false if all failed
 */
bool isConnectivityAvailable()
{
    const char *PING_SERVER = "8.8.8.8";
    const uint16_t PING_PORT = 53;
    const uint16_t PING_TIMEOUT = 5000;

    unsigned long now = millis();

    // Perform connectivity check at regular intervals (every 15 minutes) to avoid excessive pinging
    if (now - CommsManagerState.lastConnectivityCheck < 60000 * 15)
    {
        return !CommsManagerState.allCommsUnavailable;
    }

    CommsManagerState.lastConnectivityCheck = now;

