CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
        return true;
    }
    catch (...)
    {
        Serial.println("buildMQTTTelemetryPayload: Exception occurred while building payload");
        return false;
    }
}

/// @brief Send telemetry data to MQTT broker
/// @param broker MQTT broker hostname/IP address
/// @param port MQTT broker port (default 1883)
/// @param client_id MQTT client ID (0-5)
/// @param topic MQTT topic to publish to
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @return true if telemetry sent successfully, false otherwise
bool sendGsmMQTTTelemetry(const char *broker, uint16_t port, uint8_t client_id, const char *topic,
                          const char *username = nullptr, const char *password = nullptr)
{
    // Check if GPRS is available (required for MQTT over GSM)
    if (!CommsManagerState.gsmOnline || !modem.state().gprsConnected)
    {
        Serial.println("sendMQTTTelemetry: GPRS not connected - cannot send telemetry");
        return false;
    }
    const gsm::MqttConnectionStatus status = gsmMqtt.status(client_id);
    if (status == gsm::MqttConnectionStatus::Disconnected)
    {
        Serial.println("sendMQTTTelemetry: Opening MQTT broker connection...");
        if (!gsmMqtt.configure(client_id, 1, 1) || !gsmMqtt.open(client_id, broker, port))
        {
            Serial.print("sendMQTTTelemetry: Failed to open MQTT broker - Error: ");
            Serial.println(modem.failures().mqttInitError);
            return false;
        }
    }
    // BrokerOpen still requires MQTT authentication; do not reopen the transport.
    if (status != gsm::MqttConnectionStatus::Connected)
    {
        if (client_id == MQTT_CLIENT_ID)
            gsmMqttSubscriptionReady = false;
        Serial.println("sendMQTTTelemetry: Connecting MQTT client...");
        if (!gsmMqtt.connect(client_id, esp_chipid, username, password))
        {
            Serial.print("sendMQTTTelemetry: Failed to connect MQTT client - Error: ");
            Serial.println(modem.failures().mqttInitError);
            return false;
        }
    }

    // Build telemetry payload
    char mqtt_payload[2048] = {}; // Large buffer for comprehensive telemetry
    if (!buildMQTTTelemetryPayload(mqtt_payload, sizeof(mqtt_payload)))
    {
        Serial.println("sendMQTTTelemetry: Failed to build telemetry payload");
        return false;
    }

    Serial.print("sendMQTTTelemetry: Payload size: ");
    Serial.print(strlen(mqtt_payload));
    Serial.println(" bytes");

    // Publish telemetry
    Serial.print("sendMQTTTelemetry: Publishing to topic: ");
    Serial.println(topic);

    if (!gsmMqtt.publish(client_id, 1, topic, mqtt_payload, 1, 0))
    {
        Serial.println("sendMQTTTelemetry: Failed to publish telemetry");
        return false;
    }

    Serial.println("sendMQTTTelemetry: Telemetry published successfully");
    count_sends++;
    return true;
}

/// @brief Initialize MQTT and send telemetry, with automatic cleanup
/// @param broker MQTT broker hostname/IP
/// @param port MQTT broker port
/// @param topic MQTT topic for telemetry
/// @param client_id MQTT client ID
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @param disconnect_after If true, disconnect and close broker after sending
/// @return true if successful, false otherwise
bool initAndSendMQTTTelemetry(const char *broker, uint16_t port, const char *topic, uint8_t client_id = 0,
                              const char *username = nullptr, const char *password = nullptr,
                              bool disconnect_after = true)
{
    bool result = sendGsmMQTTTelemetry(broker, port, client_id, topic, username, password);

    if (disconnect_after && gsmMqtt.isBrokerConnected(client_id))
    {
        delay(500);
        Serial.println("initAndSendMQTTTelemetry: Disconnecting MQTT...");
        gsmMqtt.disconnect(client_id);
        if (client_id == MQTT_CLIENT_ID)
            gsmMqttSubscriptionReady = false;
    }

    return result;
}

/// @brief Send telemetry data to MQTT broker via WiFi (PubSubClient)
/// @param broker MQTT broker hostname/IP address
/// @param port MQTT broker port (default 1883)
/// @param client_id MQTT client ID
/// @param topic MQTT topic to publish to
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @return true if telemetry sent successfully, false otherwise
bool sendWiFiMQTTTelemetry(const char *broker, uint16_t port, const char *client_id, const char *topic,
                           const char *username = nullptr, const char *password = nullptr)
{
    // Check if WiFi is connected
    if (WiFi.status() != WL_CONNECTED)
    {
        Serial.println("sendWiFiMQTTTelemetry: WiFi not connected - cannot send telemetry");
        return false;
    }

    Serial.println("sendWiFiMQTTTelemetry: WiFi connected, proceeding with MQTT publish");

    // Build telemetry payload
    char mqtt_payload[2048] = {}; // Large buffer for comprehensive telemetry
    if (!buildMQTTTelemetryPayload(mqtt_payload, sizeof(mqtt_payload)))
    {
        Serial.println("sendWiFiMQTTTelemetry: Failed to build telemetry payload");
        return false;
    }

    Serial.print("sendWiFiMQTTTelemetry: Payload size: ");
    Serial.print(strlen(mqtt_payload));
    Serial.println(" bytes");

    // Send telemetry via WiFi MQTT
    bool result = wifiMQTTSendTelemetry(broker, port, topic, client_id, mqtt_payload, username, password, false);

    if (result)
    {
        Serial.println("sendWiFiMQTTTelemetry: Telemetry sent successfully via WiFi");
        count_sends++;
    }
    else
    {
        Serial.println("sendWiFiMQTTTelemetry: Failed to send telemetry via WiFi");
    }

    return result;
}

void buildDeviceInfoJSON()
{
    try
    {
        // Clear previous data
        device_info.clear();

        // Add GSM configuration if GSM is capable and has valid data
        if (gsm_capable && (gsmRuntimeInfo.operatorName.length() > 0 ||
                            gsmRuntimeInfo.imei.length() > 0 ||
                            gsmRuntimeInfo.simCcid[0] != '\0'))
        {
            JsonObject gsm = device_info["GSM"].to<JsonObject>();

            if (gsmRuntimeInfo.operatorName.length() > 0)
                gsm["Operator Name"] = gsmRuntimeInfo.operatorName;
            if (gsmRuntimeInfo.signalStrength > 0)
                gsm["Signal Strength"] = gsmRuntimeInfo.signalStrength;
            if (gsmRuntimeInfo.networkTechnology[0] != '\0')
                gsm["Network Technology"] = gsmRuntimeInfo.networkTechnology;
            if (gsmRuntimeInfo.imei.length() > 0)
                gsm["IMEI"] = gsmRuntimeInfo.imei;
            if (gsmRuntimeInfo.modelId.length() > 0)
                gsm["Model"] = gsmRuntimeInfo.modelId;
            if (gsmRuntimeInfo.firmwareVersion.length() > 0)
                gsm["Firmware"] = gsmRuntimeInfo.firmwareVersion;
            if (gsmRuntimeInfo.simCcid[0] != '\0')
                gsm["SIM CCID"] = gsmRuntimeInfo.simCcid;
        }

        // Add WiFi configuration if WiFi is connected and has valid data
        if (wifi_info["SSID"].as<String>().length() > 0 ||
            wifi_info["IP Address"].as<String>().length() > 0)
        {
            JsonObject wifi = device_info["WIFI"].to<JsonObject>();

